*> AUTHOR -> LUCAS CAMPOS 14/03/2017
IDENTIFICATION DIVISION.
PROGRAM-ID. MEDIA-ARITMETICA.
ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
		SPECIAL-NAMES.
			DECIMAL-POINT IS COMMA.
DATA DIVISION.
	WORKING-STORAGE SECTION.
	
		01 DATE-TIME.
			02 YEARS PIC 9(02).
			02 MONTHS PIC 9(02).
			02 DAYS PIC 9(02).
			
		01 DATA-ALUNO.
			02 NOTA-P1-INT							PIC 9(04) VALUE ZEROS.
			02 NOTA-P1-DEC REDEFINES NOTA-P1-INT	PIC 9(02)V99.
			02 NOTA-P1-DOT							PIC 99,99.
			
			02 NOTA-P2-INT							PIC 9(04) VALUE ZEROS.
			02 NOTA-P2-DEC REDEFINES NOTA-P2-INT	PIC 9(02)V99.
			02 NOTA-P2-DOT 							PIC 99,99.
			
			02 NOTA-P3-INT							PIC 9(04) VALUE ZEROS.
			02 NOTA-P3-DEC REDEFINES NOTA-P3-INT	PIC	9(02)V99.
			02 NOTA-P3-DOT							PIC 99,99.
			
			02 P3-STATUS							PIC 9(1) BINARY VALUE ZERO.
			02 COUNT-NOTA							PIC 9(1) VALUE ZERO.
			02 MEDIA-DEC							PIC 9(02)V99.
			02 MEDIA-DOT							PIC 99,99.
			
	SCREEN SECTION.
		
		01 MAIN-SCREEN.
			02 LINE 01 COLUMN 05 PIC 9(02)/ USING DAYS.
			02 LINE 01 COLUMN 08 PIC 9(02)/ USING MONTHS.
			02 LINE 01 COLUMN 11 PIC 9(02) USING YEARS.
			02 LINE 01 COLUMN 20 VALUE "MEDIA ARITMETICA (NOTA ALUNO)".
			02 LINE 03 COLUMN 15 VALUE "NOTA P1: ".
			02 LINE 05 COLUMN 15 VALUE "NOTA P2: ".
			02 LINE 10 COLUMN 15 VALUE "MEDIA: --,--".
			02 LINE 11 COLUMN 15 VALUE "STATUS: --------".
		01 CLEAR-SCREEN.
			02 BLANK SCREEN.
		
PROCEDURE DIVISION.
	INIT.
		ACCEPT DATE-TIME FROM DATE.
		DISPLAY CLEAR-SCREEN.
		DISPLAY MAIN-SCREEN AT 0101.
		
		PERFORM NOTA-P1 TEST AFTER UNTIL NOTA-P1-DEC <= 10,0.
		ADD 1 TO COUNT-NOTA.
		DISPLAY NOTA-P1-DOT AT 0329.
		
		PERFORM CALCULAR-NOTA.
		
		PERFORM NOTA-P2 TEST AFTER UNTIL NOTA-P2-DEC <= 10,0.
		ADD 1 TO COUNT-NOTA.
		DISPLAY NOTA-P2-DOT AT 0529.
		
		PERFORM CALCULAR-NOTA.
		
		IF MEDIA-DEC < 4,9 THEN
			PERFORM NOTA-P3 TEST AFTER UNTIL NOTA-P3-DEC <= 10,0
			DISPLAY NOTA-P3-DOT AT 0729
            PERFORM CALCULAR-NOTA
		END-IF.
		
		STOP " ".
		GOBACK.
	END-INIT.
		
	NOTA-P1.
		ACCEPT NOTA-P1-INT AT 0324.
		MOVE NOTA-P1-DEC TO NOTA-P1-DOT.
		
	NOTA-P2.
		ACCEPT NOTA-P2-INT AT 0524.
		MOVE NOTA-P2-DEC TO NOTA-P2-DOT.
		
	NOTA-P3.
		DISPLAY "NOTA P3: " AT 0715.
		ACCEPT NOTA-P3-INT AT 0724.
		MOVE NOTA-P3-DEC TO NOTA-P3-DOT.
        IF NOTA-P3-DEC <= 10,0 THEN
		    IF NOTA-P1-DEC < NOTA-P2-DEC THEN
			    MOVE NOTA-P3-DEC TO NOTA-P1-DEC
			    DISPLAY "(X)" AT 0335
		    ELSE
			    MOVE NOTA-P3-DEC TO NOTA-P2-DEC
			    DISPLAY "(X)" AT 0535
		    END-IF
		    MOVE 1 TO P3-STATUS
        END-IF.
		
	CALCULAR-NOTA.
		COMPUTE MEDIA-DEC = (NOTA-P1-DEC+NOTA-P2-DEC)/COUNT-NOTA.
		MOVE MEDIA-DEC TO MEDIA-DOT.
		
		IF MEDIA-DEC > 4,9 AND COUNT-NOTA > 1 THEN
			DISPLAY "APROVADO" AT 1123 FOREGROUND-COLOR IS 2
		END-IF.
		
		IF MEDIA-DEC < 5,0 AND COUNT-NOTA > 1 AND P3-STATUS = 1 THEN
			DISPLAY "REPROVADO" AT 1123 FOREGROUND-COLOR IS 4
		END-IF.
		
		DISPLAY MEDIA-DOT AT 1022.
