*> AUTHOR -> LUCAS CAMPOS 14/03/2017
IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULADORA.
ENVIRONMENT DIVISION.
		CONFIGURATION SECTION.
			SPECIAl-NAMES.
				DECIMAL-POINT IS COMMA.
DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 DATE-TIME.
		02 DAYS 		PIC 9(02).
		02 MONTHS 		PIC 9(02).
		02 YEARS 		PIC 9(02).
	01 DATA-NUMBER.
		02 NUMBER-1							PIC -ZZZZZZZZ9.
		02 NUMBER-1-RED REDEFINES NUMBER-1	PIC S9(09).
		02 NUMBER-2							PIC -ZZZZZZZZ9.
		02 NUMBER-2-RED REDEFINES NUMBER-2	PIC S9(09).
		
		02 W-SUM			PIC S9(09).
		02 W-SUM-MASK		PIC -ZZZZZZZZ9.
		02 W-SUB			PIC S9(09).
		02 W-SUB-MASK		PIC -ZZZZZZZZ9.
		02 W-MUL			PIC S9(09).
		02 W-MUL-MASK		PIC -ZZZZZZZZ9.
		02 W-DIV			PIC S9(09)V99.
		02 W-DIV-MASK		PIC -ZZZZZZZZ9,99.
	SCREEN SECTION.
	01 MAIN-SCREEN.
		02 LINE 01 COLUMN 04 PIC 9(02)/ USING DAYS FOREGROUND-COLOR 2.
		02 LINE 01 COLUMN 07 PIC 9(02)/ USING MONTHS FOREGROUND-COLOR 2.
		02 LINE 01 COLUMN 10 PIC 9(02) USING YEARS FOREGROUND-COLOR 2.
		02 LINE 01 COLUMN 20 VALUE "CALCULADORA" FOREGROUND-COLOR 2.
		02 LINE 03 COLUMN 10 VALUE "NUMBER-1: " FOREGROUND-COLOR 5.
		02 LINE 05 COLUMN 10 VALUE "NUMBER-2: " FOREGROUND-COLOR 5.
		02 LINE 07 COLUMN 10 VALUE "SUM: ".
		02 LINE 08 COLUMN 10 VALUE "SUB: ".
		02 LINE 09 COLUMN 10 VALUE "MUL: ".
		02 LINE 10 COLUMN 10 VALUE "DIV: ".
	01 CLEAR-SCREEN.
		02 BLANK SCREEN.
PROCEDURE DIVISION.
	INIT.
		ACCEPT DATE-TIME FROM DATE.
		DISPLAY CLEAR-SCREEN.
		DISPLAY MAIN-SCREEN AT 0101.
		
		ACCEPT NUMBER-1 AT 0320.
        MOVE NUMBER-1 TO NUMBER-1-RED.
		ACCEPT NUMBER-2 AT 0520.
        MOVE NUMBER-2 TO NUMBER-2-RED.
		
		PERFORM COMPUTER.
		
		STOP " ".
		STOP RUN.
		
	COMPUTER.
		ADD NUMBER-1-RED NUMBER-2-RED GIVING W-SUM.
		MOVE W-SUM TO W-SUM-MASK.
		DISPLAY W-SUM-MASK AT 0715.
		
		SUBTRACT NUMBER-2-RED FROM NUMBER-1-RED GIVING W-SUB.
		MOVE W-SUB TO W-SUB-MASK.
		DISPLAY W-SUB-MASK AT 0815.
		
		MULTIPLY NUMBER-1-RED BY NUMBER-2-RED GIVING W-MUL.
		MOVE W-MUL TO W-MUL-MASK.
		DISPLAY W-MUL-MASK AT 0915.
		
		IF NUMBER-2-RED <> 0 THEN
			DIVIDE NUMBER-1-RED BY NUMBER-2-RED GIVING W-DIV
			MOVE W-DIV TO W-DIV-MASK
			DISPLAY W-DIV-MASK AT 1015
		ELSE
			DISPLAY "NO DIVIDE BY ZERO" AT 1015
		END-IF.
		
	
